[
  {
    "path": "posts/2021-02-21-apps-gratuitas-para-proyectos/",
    "title": "14 Apps Gratuitas para Proyectos",
    "description": "En el siguiente articulo te cuento sobre algunas aplicaciones free para utilizar en tus proyectos.",
    "author": [
      {
        "name": "Romina Mendez",
        "url": {}
      },
      {
        "name": "",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-02-21",
    "categories": [
      "Proyectos",
      "Metodologias"
    ],
    "contents": "\n\nContents\nMetodolog铆asTrello\nMiro\nQuire\nAsana\nClikup\nScrumblr\nGitmind\nHabitica\n\nDiagramasDraw.io\nMindmup\n\nEstimaci贸n de tiemposPlanning poker\n\nDise帽oCanva\n\nMensajeriaSlack\nDiscord\n\n\nLa pandemia de coronavirus impulso el home office y muchos empleados se vieron obligados a transformar su forma de trabajar. Este contexto genero un cambio en la forma en la que nos relacionamos y desempe帽amos nuestras tareas diarias.\n\nA continuaci贸n te recopilo un listado de herramientas y recursos que puedes utilizar para poder desarrollar tu tareas y gestionar tus proyectos.\nMetodolog铆as\nTrello\nTrello es una aplicaci贸n basada en la metodolog铆a Kanban y permite gestionar tu trabajo de forma colaborativa. Su version gratuita tiene tableros personales ilimitados, tarjetas ilimitadas al igual que listas y hasta 10MB por archivo adjunto. \nMiro\nMiro es una aplicaci贸n que te permite tener pizarras, en las cuales los integrantes de los equipos puedan colaborar y modificarlas en tiempo real. Asimismo posee m煤ltiples plantillas que pueden ser utilizadas para realizar la planificaci贸n de un proyecto. En su version gratuita permite principalmente tener: 3 tableros editables, espectadores an贸nimos y plantillas.\n\nQuire\nQuire es una aplicaci贸n que implementa el tablero Kanban, en su sitio web mencionan que hasta la primera mitad del 2020 no tiene precios definidos y que puedes tener una cuenta gratuita con hasta 35 organizaciones, 80 proyectos y 30 miembros.\n source image : imagen obtenida en https://quire.io/\nAsana\nAsana es una aplicaci贸n que permite organizar proyectos utilizando tableros Kanban en linea. En su version free permite hasta 15 miembros y vistas de calendarios, asignaci贸n de responsables y fechas de entregas.\n imagen obtenida en https://asana.com/es\nClikup\nClikup es una aplicaci贸n para gestionar tus proyectos, la cual permite generar documentos, notificaciones y administrar tu bandeja de entrada. Adicionalmente permite realizar dashboard para ver el avance de los proyectos. Lo m谩s importante es que su version free tiene 100MB Storage e ilimitadas tareas y usuarios.\n imagen obtenida en https://clickup.com/welcome\nScrumblr\nScrumblr es una aplicaci贸n que permite generar un tablero de Kanban y su colaboraci贸n en tiempo real. Lo m谩s destacable de esta aplicaci贸n es que no necesitas generar un usuario, ya que el 煤nico dato que solicita es el nombre de tu tablero.\n\nGitmind\nGitmind es una herramienta para realizar diagramas de mapas mentales y la misma es gratuita \nimagen obtenida en gitmind\nHabitica\nHabitica es una aplicaci贸n para gestionar proyectos de manera m谩s divertida, ya que puedes administrar tus tareas por medio de un juego de rol. Si completas todos las tareas pendientes puedes progresar en el juego, pero si fallamos nuestro personaje va retroceder en este juego.\n imagen obtenida de mi perfil de habitica\nDiagramas\nDraw.io\nDraw.io es una aplicaci贸n gratuita que permite la creaci贸n y edici贸n de diagramas. La misma permite a los usuarios compartir sus diagramas y posee integraciones con Google Drive y Dropbox. Esta aplicaci贸n tiene varios templates reutilizables tales como diagramas de Venn, wireframes, network, flowcharts, UML, entre otros.\n Imagen obtenida de mi cuenta de https://www.draw.io/\nMindmup\nMindmup es una aplicaci贸n gratuita que permite crear mapas mentales de forma ilimitada y guardarlo en la nube.\n\nEstimaci贸n de tiempos\nPlanning poker\nPlanning poker es una t茅cnica que permite realizar la estimaci贸n del tiempo de una tarea en un equipo para la planificaci贸n del sprint. Esta t茅cnica se realiza utilizando cartas numeradas con las secuencia de Fibonacci. Si quieres desarrollar esta t茅cnica en forma online, puede utilizar la aplicaci贸n www.planningpoker.com. En su version gratuita permite hasta 5 usuarios en un juego.\n\nDise帽o\nCanva\nCanva es una aplicaci贸n online de dise帽o gr谩fico simplificado, en el cual puedes crear una pieza de dise帽o utilizando los cientos de templates tiene disponibles. Puedes utilizar la cuenta gratuita y solo pagas para obtener algunas opciones avanzadas de dise帽o.\n\nMensajeria\nSlack\nSlack es una herramienta de mensajer铆a en tiempo real que permite gestionar la comunicaciones con los equipos de trabajo o comunidades. Cuando utilizas un espacio en slack puedes generar canales en los cuales se pueden comunicar mensajes basados en alg煤n t贸pico.\n\nDiscord\nDiscord es otra plataforma para crear grupo de chats, en el cual tambi茅n puedes organizar las conversaciones en canales por temas \nimagen obtenida en https://discord.com/new\nEstas son las aplicaciones que te recomiendo utilizar para la gesti贸n de tus tareas y proyectos. Recuerda que cualquiera de esta herramientas te puedo ayudar a realizar tus proyectos o gestion de tareas diarias de una maneras m谩s ordenadas. Si tienes alguna otra herramienta que conoces y no esta en este articulo, puedes dejar un comentario en este post.\n\n\n\n",
    "preview": "https://i.ibb.co/8cggRCg/Dev-Ops-team-abstract-concept-vector-illustration-Software-development-team-member-agile-workflow-De.jpg",
    "last_modified": "2021-02-21T16:22:49-03:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-02-21-cheatsheet-sql/",
    "title": "CheatSheet SQL",
    "description": "En el siguiente post puedes encontrar una cheetsheet de SQ, en la cual puedes encontrar un resumen y ejemplos de la sintaxis de SQL.",
    "author": [
      {
        "name": "Romina Mendez",
        "url": {}
      },
      {
        "name": "",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-02-21",
    "categories": [
      "Base de datos",
      "SQL"
    ],
    "contents": "\nLas cheetsheet son un conjunto de notas  que se utilizan como referencia r谩pida sobre alguna tematica. Tambi茅n son conocidos como los machetes en los cuales se registraban peque帽os conceptos a recordar .\n\n\nEn el siguiente pdf podes encontrar la sintaxis basica para poder realizar consultas en sql\n\n\n\n\n\n",
    "preview": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/Cheating.JPG/1200px-Cheating.JPG",
    "last_modified": "2021-02-21T18:51:04-03:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-02-21-introduccin-a-visualizaciones-con-python/",
    "title": "Introducci贸n a Visualizaciones con Python",
    "description": "Primeros pasos para comenzar a realizar tus primeras visualizaciones en Python.",
    "author": [
      {
        "name": "Romina Mendez",
        "url": {}
      },
      {
        "name": "",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-02-21",
    "categories": [
      "DataViz",
      "Python",
      "Data",
      "Programacion",
      "Workshop"
    ],
    "contents": "\n\nContents\n驴Que es Python ?\n驴Que es Google Colab ?Recursos\n\n\nLa programaci贸n es una habilidad que puede ser adquirida de manera autodidacta, pero a veces uno no sabe como empezar. Por lo cual te dejo este curso online realizado en el 2020  en conjunto con EANT, el cual en solo 3 horas 憋 podes dar tus primeros pasos en el desarrollo de visualizaci贸nes con Python.\n驴Que es Python ?\nPython es un lenguaje de programaci贸n de c贸digo abierto, orientado a objetos, muy simple y f谩cil de entender. Tiene una sintaxis sencilla que cuenta con una vasta biblioteca de herramientas, que hacen de Python un lenguaje de programaci贸n 煤nico. La primera publicaci贸n de Python se produce hace ya 30 a帽os, ya que en 1989 Guido Van Rossum comenz贸 el desarrollo de un nuevo lenguaje de programaci贸n casi por hobby y tomando su nombre de el grupo humor铆stico brit谩nico Monty Python.\nActualmente es uno de los lenguajes m谩s utilizados para an谩lisis de datos, pero tambi茅n es considerado un lenguaje multi-proposito debido a gran cantidad de aplicaci贸nes que se pueden desarrollar con Python.\n\n\nM谩s informaci贸n sobre Python\n驴Que es Google Colab ?\n\n\n\n\n\nGoogle Colab es una IDE (Entorno de desarrollo integrado) para poder progrmar en Python utilizando google drive.\n Es un marco de desarrollo amigable, el cual permite:\nAutocompletado\nReconocimiento de sintaxis de programaci贸n\nDepurador de errores\nTiene librerias preinstaladas\nSe utiliza desde drive lo cual permite versionar tu codigo y trabajar en conjunto con otros colaboradoes.\nPara conocer m谩s sobre Colab puedes copiar esta notebook: Notebook \n\nRecursos\nPresentaci贸n:\n\n\nAcceso al curso Online: Workshop EANT\n\n\n\n",
    "preview": "https://i.ibb.co/HqsbFFg/linear-infographic-vector-elements.jpg",
    "last_modified": "2021-02-21T22:44:50-03:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-02-21-introduccin-a-visualizaciones-con-r/",
    "title": "Introducci贸n a Visualizaciones con R",
    "description": "Primeros pasos para comenzar a realizar tus primeras visualizaciones en R.",
    "author": [
      {
        "name": "Romina Mendez",
        "url": {}
      },
      {
        "name": "",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-02-21",
    "categories": [
      "DataViz",
      "R",
      "Data",
      "Programacion",
      "Workshop"
    ],
    "contents": "\n\nContents\n驴Que es ?\n驴Que es Rstudio ?Rstudio Cloud 锔\n\nTemario驴Estas preparado para comenzar ?\nRecursos\n\n\nLa programaci贸n es una habilidad que puede ser adquirida de manera autodidacta, pero a veces uno no sabe como empezar. Por lo cual te dejo este curso online realizado en el 2020  en conjunto con EANT, el cual en solo 3 horas 憋 podes dar tus primeros pasos en el desarrollo de visualizaci贸nes con R.\n驴Que es ?\nR es uno de los lenguajes m谩s populares que se utiliza para el procesamiento y analisis estad铆stico de datos. Este lenguaje es una reimplementaci贸n de otro lenguaje denominado S, aunque tambien tiene bases de lenguajes como C, C++ o Fortran. R es muy popular debido a que actualmente se lo utiliza para el desarrollo de modelos de machine learning, pero tambien con este lenguaje se puede realizar desarrollo de: sitio webs, APIs, procesamiento de datos y hasta puedes desarrollar tu CV.\nM谩s informaci贸n sobre R\n驴Que es Rstudio ?\n\n\n\n\n\nRstudio es una IDE (Entorno de desarrollo integrado) para poder progrmar en R, aunque actualmente soporta otros lenguajes tales como Python y Javascript.\n Esta IDE esta en constante evoluci贸n y es la m谩s utilizada para desarrollar en R debido que posee una interfaz con ayuda en linea, autocompletado de codigo, la posibilidad de realizar una depuraci贸n del codigo de manera sencilla, visualizaci贸n de directorios, entre otras.\nA continuaci贸n puede ver una linea de tiempo con la evoluci贸n de esta IDE en los ultimos a帽os.[Un poco de historia sobre rstudio y su evoluci贸n. 1 \n\n\nRstudio Cloud 锔\nRstudio cloud es una version basada en la nube que permite realizar el desarrollo sin necesidad de realizar ninguna instalaci贸n utilizando solo un navegador.\nEl plan free te permite:\nGenerar hasta 15 proyectos.\nUn espacio compartido con 5 miembros y 10 proyectos como maximo.\n15 horas de proyectos por mes.\nHasta 1 GB de RAM por proyecto.\nHasta 1 CPU por proyecto\nHasta 1 hora de tiempo en ejecuci贸n en segundo plano.\nTemario\nEn este workshop online vas a poder aprender sobre:\n锔 Qu茅 es Data Analytics y sus etapas de trabajo.\n锔 El concepto del an谩lisis exploratorio de datos (EDA).\n锔 Qu茅 es R y por qu茅 es una de las herramientas m谩s utilizadas en los 谩mbitos de trabajo de Data Science.\n锔 Utilizar la interfaz de Rstudio.\n锔 Dar primeros pasos en programaci贸n para la manipulaci贸n y exploraci贸n de Datos.\n锔 Qu茅 son y c贸mo utilizar librer铆as de c贸digo para realizar operaciones de an谩lisis.\n锔 C贸mo realizar distintos an谩lisis mediante gr谩ficos y visualizaciones (dataviz).\n锔 Tips, recomendaciones y recursos 煤tiles para seguir aprendiendo!\n驴Estas preparado para comenzar ?\nA continuaci贸n tienes todos los recursos para comenzar y hacer tus primeras visualizaci贸n con datos .\n\nRecursos\nAcceso al curso Online: Workshop EANT\nPresentaci贸n:\n\n\nRstudio TimeLine\n\n╋\n",
    "preview": "https://i.ibb.co/HqsbFFg/linear-infographic-vector-elements.jpg",
    "last_modified": "2021-02-21T22:45:29-03:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-03-06-dnde-est-mi-monopatn/",
    "title": "驴D贸nde est谩 mi monopat铆n?",
    "description": "Recursos del evento IWD2020 (International Womens Day) de Women Techmakers, en el cual utilizamos python para encontrar monopatines en la Ciudad Autonoma de Buenos Aires.",
    "author": [
      {
        "name": "Romina Mendez",
        "url": {}
      },
      {
        "name": "",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-02-21",
    "categories": [
      "DataViz",
      "Python",
      "Data",
      "Mapas",
      "Programacion",
      "Workshop"
    ],
    "contents": "\n\nContents\n驴D贸nde est谩 mi monopat铆n? Encontralo con Python \n\n驴D贸nde est谩 mi monopat铆n? Encontralo con Python \nGDG Buenos Aires: Women Techmakers Buenos Aires\nWomen Techmakers es el programa global de Google que promueve un espacio de visibilidad, comunidad y recursos para fomentar la diversidad en tecnolog铆a.\n\n\n\nEn el encuentro IWD2020  (International Womens Day), realizamos un Hands-on Labs online con Kari Bartolome y Aidin Rodriguez para ense帽ar a utilizar Google Colab con Python utilizando datos publicos, el problema resolver es: 驴D贸nde est谩 mi monopat铆n?\n\n\n Si queres conocer m谩s sobre Google Colab y Python podes ver el siguiente post: Introducci贸n a visualizaciones con python\nAPI DE TRANSPORTE\nPara realizar esta actividad es necesario contar con las credenciales de la API de transporte del Gobierno de la Ciudad de Buenos Aires, las mismas se pueden obtener las credenciales se debe ingresar a este link: https://www.buenosaires.gob.ar/form/formulario-de-registro-api-transporte\nUna vez finalizada la carga del formulario, en unos minutos va recibir un correo con sus credenciales (controle si las mismas no llegan a su correo SPAM).\nPara ver la documentaci贸n de la API\n\n* Para ver el taller nuevamente\nEn este  link puedes encontrar el video con la resoluci贸n del taller.\nAqui puedes encontrar las notebooks link\n\n\n\n\n",
    "preview": "https://i.pinimg.com/474x/73/c1/12/73c112b17867018cc6f384248300d3ab.jpg",
    "last_modified": "2021-03-06T13:39:45-03:00",
    "input_file": {}
  }
]
